#+title: Managing multiple software versions with Org-mode
#+date: <2023-02-16 Thu>
#+author: Nasser Alkmim
#+draft: nil
#+toc: t
#+tags[]: tools emacs C++ org-mode trilinos
#+lastmod: 2023-05-18 11:58:06
#+PROPERTY: header-args :exports both
* Configuring and building

Now that the configuration setting is defined and properly stored, we can continue to configure and build.

#+begin_src sh
TRILINOS_BUILD_DIR=trilinos-release-13-4-1
cd ~/.local/src/Trilinos/build/$TRILINOS_BUILD_DIR
rm -f CMakeCache.txt
cmake -D Trilinos_CONFIGURE_OPTIONS_FILE=config.cmake ../../ | tee config.out
make -j32
make install
#+end_src

We can check the installation by "grepping" the Trilinos version in the installation directory.

#+begin_src sh
grep -R def.*TRILINOS_VERSION_STRING ~/.opt/trilinos-release-13-4-1/include
#+end_src

#+RESULTS:
: /home/nasser/.opt/trilinos-release-13-4-1/include/Trilinos_version.h:#define TRILINOS_VERSION_STRING "13.4.1"

In Org mode, I use the [[https://www.google.com/url?q=https://sr.ht/~niklaseklund/detached.el/&sa=U&ved=2ahUKEwjNl_eA7Jn9AhXqxwIHHVsUCi4QFnoECAoQAg&usg=AOvVaw1P7qtc_mkzNpopXCkrjB2n][Detached]] package, which runs this shell command in a process independent of emacs.
This works like an "async" feature, and the result is that it does not block emacs.
It could be even used to run things on another computer.

** CMake /prefix path/

CMake /config files/ allow CMake to find the packages with =find_package= function.
For Trilinos, there is this option that is turned on by default.

#+begin_src sh
grep "ENABLE.*CMAKE_CONFIG_FILES.*BOOL" build/CMakeCache.txt
#+end_src

#+RESULTS:
: Trilinos_ENABLE_INSTALL_CMAKE_CONFIG_FILES:BOOL=ON

On the "downstream" project, if a nonstandard location is used for the installation, we need to tell CMake where to look for the config files with[fn:73],

#+begin_src sh
-D CMAKE_PREFIX_PATH=<where you installed>
#+end_src

Or in the ~CMakeLists.txt~ directly[fn:74]

#+begin_src makefile
list(APPEND CMAKE_PREFIX_PATH "<where you installed>")
#+end_src

[fn:73] [[https://cmake.org/cmake/help/v3.0/variable/CMAKE_PREFIX_PATH.html#:~:text=Path%20used%20for%20searching%20by,subdirectories%20to%20the%20base%20directories.][CMAKE_PREFIX_PATH — CMake 3.0.2 Documentation]] 

[fn:74] [[https://stackoverflow.com/a/55122281][c++ - CMakeList set CMAKE_PREFIX_PATH - Stack Overflow]] 


